# DGNImportOptions Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DGNImportOptions Constructor
DGNImportOptions Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DGNImportOptions()()()() | Constructs a new instance of DGNImportOptions with default values of all properties. |
| DGNImportOptions(DGNImportOptions) | Constructs a new instance of DGNImportOptions as a copy of the import options. |

# See Also
DGNImportOptions Class
DGNImportOptions Members
Autodesk.Revit.DB Namespace